---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForToposolid
source: html/c17cbfe5-b888-c9b9-ad05-3b8a6e28fe75.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForToposolid Property

Toposolid sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketchForToposolid { get; }
```